Repository: mrrobotisreal/AspireWithAlina
Catalog: lib/l10n/app_*.arb
Languages: pt_pt

# appTitle
source: Aspire With Alina
pt_pt: Aspire com a Alina

# common_emailAddress
source: Email address
pt_pt: Endereço de e-mail

# common_errorMessage
source: The following error occurred: {error}
pt_pt: Ocorreu o seguinte erro: {error}

# common_errorTitle
source: Error
pt_pt: Erro

# common_firstName
source: First name (Given name)
pt_pt: Primeiro nome (Nome próprio)

# common_lastName
source: Last name (Family name)
pt_pt: Apelido (nome de família)

# common_okayTitle
source: Okay
pt_pt: Ok

# common_passwordTitle
source: Password
pt_pt: Palavra-passe

# common_settingsTitle
source: Settings
pt_pt: Configurações

# common_submit
source: Submit
pt_pt: Enviar

# registrationCodeError
source: Error occurred. Please check your connection.
pt_pt: Ocorreu um erro. Por favor, verifique a sua ligação.

# registrationCodeInputHint
source: Registration code
pt_pt: Código de registo

# registrationCodeInputLabel
source: Please input your registration code
pt_pt: Por favor insira o seu código de registo

# registrationCodeIsEmpty
source: Please enter a registration code.
pt_pt: Por favor introduza um código de registo.

# registrationCodeIsInvalid
source: Oops! It looks like the registration code you entered is either expired or invalid. Please check to make sure you entered the code correctly and try again. If the registration code continues to fail, please contact Alina at alina.ranok@gmail.com.
pt_pt: Ops! Parece que o código de registo introduzido expirou ou é inválido. Verifique se introduziu o código corretamente e tente novamente. Se o código de registo continuar a falhar, contacte a Alina em alina.ranok@gmail.com.

# registrationCodeServerError
source: Server error. Please try again later.
pt_pt: Erro no servidor. Por favor, tente mais tarde.

# registrationCodeSubmitButton
source: Let''s begin!
pt_pt: Vamos começar!

# settings_darkTheme
source: Dark theme
pt_pt: Tema escuro

# settings_lightTheme
source: Light theme
pt_pt: Tema claro

# settings_systemTheme
source: System theme
pt_pt: Tema do sistema

# studentInfoForm_description
source: Please fill out the form below to complete your registration. Once you have completed the form, click the "Submit" button to create your account. You will then be able to use your email address and password to log in to the app.
pt_pt: Por favor, preencha o formulário abaixo para completar o seu registo. Depois de preencher o formulário, clique no botão "Submeter" para criar a sua conta. Poderá então utilizar o seu endereço de e-mail e palavra-passe para iniciar sessão na aplicação.

# studentInfoForm_emailErrorText_empty
source: Email address cannot be empty.
pt_pt: O endereço de e-mail não pode ficar vazio.

# studentInfoForm_emailErrorText_invalid
source: Please enter a valid email address.
pt_pt: Introduza um endereço de e-mail válido.

# studentInfoForm_emailInputLabel
source: Please enter your email address
pt_pt: Por favor introduza o seu endereço de e-mail

# studentInfoForm_nativeLanguageLabel
source: Please select your native language
pt_pt: Por favor selecione o seu idioma nativo

# studentInfoForm_passwordErrorText_empty
source: Password cannot be empty.
pt_pt: A palavra-passe não pode ficar vazia.

# studentInfoForm_passwordErrorText_length
source: Password must be at least 8 characters long.
pt_pt: A palavra-passe deve ter pelo menos 8 caracteres.

# studentInfoForm_passwordErrorText_lowercase
source: Password must contain at least 1 lowercase letter.
pt_pt: A palavra-passe deve conter pelo menos 1 letra minúscula.

# studentInfoForm_passwordErrorText_number
source: Password must contain at least 1 number.
pt_pt: A palavra-passe deve conter pelo menos 1 número.

# studentInfoForm_passwordErrorText_specialCharacter
source: Password must contain at least 1 special character.
pt_pt: A palavra-passe deve conter pelo menos 1 caractere especial.

# studentInfoForm_passwordErrorText_uppercase
source: Password must contain at least 1 uppercase letter.
pt_pt: A palavra-passe deve conter pelo menos 1 letra maiúscula.

# studentInfoForm_passwordInputLabel
source: Please enter your password
pt_pt: Por favor introduza a sua senha

# studentInfoForm_passwordInputRequirements
source: (It must be at least 8 characters with at least 1 uppercase character, 1 lowercase character, 1 number, and 1 special character)
pt_pt: (Deve ter pelo menos 8 caracteres com pelo menos 1 caractere maiúsculo, 1 caractere minúsculo, 1 número e 1 caractere especial)

# studentInfoForm_welcomeStudent
source: Welcome, {firstName}!
pt_pt: Bem-vindo, {firstName}!

# welcomeScreen_alreadyRegisteredButton
source: Already registered?
pt_pt: Já está registado?

# welcomeScreen_inputEmail
source: Please enter your email address
pt_pt: Por favor introduza o seu endereço de e-mail

# welcomeScreen_inputPassword
source: Please enter your password
pt_pt: Por favor introduza a sua senha

# welcomeScreen_invalidEmailOrPassword
source: Email address or password is incorrect. Please check for typos and try again.
pt_pt: O endereço de e-mail ou a palavra-passe estão incorretos. Verifique se existem erros de digitação e tente novamente.

# welcomeScreen_loginTitle
source: Login to...
pt_pt: Iniciar sessão para...

# welcomeScreen_notRegisteredYetButton
source: Not registered yet?
pt_pt: Ainda não está registado?

# welcomeScreen_serverError
source: Server error. Please try again later.
pt_pt: Erro no servidor. Por favor, tente mais tarde.

# welcomeScreen_welcomeTitle
source: Welcome to...
pt_pt: Bem-vindo ao...
